package homework2;

/*
Составьте программу, выводящую на экран квадраты чисел от 10 до 20
включительно.
 */
public class homework2_3 {
    public static void main(String[] args) {
        for (int i = 10; i <= 20; i++) {
            int a = i * i;
            System.out.println(a);
        }
    }
}
